LOGIN_URL = ""
USERNAME = ""
PASSWORD = ""
TARGET_URLS: list[str] = []
LANG = ""

def setConfig(loginUrl: str, username:str, pwd: str, listUrl: list [str], lang: str, log=print):
    global LOGIN_URL, USERNAME, PASSWORD, TARGET_URLS, LANG
    LOGIN_URL = loginUrl
    if len(LOGIN_URL) <= 0:
        log("Не установлена ссылка для админки")
        return 1;
    USERNAME = username
    if len(USERNAME) <= 0:
        log("Не установлен логин")
        return 1;
    PASSWORD = pwd
    if len(PASSWORD) <= 0:
        log("Не установлен пароль")
        return 1;
    TARGET_URLS = listUrl
    if len(TARGET_URLS) <= 0:
        log("Не установлены ссылки для переводов")
        return 1;
    LANG = lang
    if len(LANG) <= 0:
        log("Не установлен язык на который собирается перевод")
        return 1;

    return 0;
    
LANGUAGES = {
    "Африкаанс": "af",
    "Албанский": "sq",
    "Амхарский": "am",
    "Арабский": "ar",
    "Армянский": "hy",
    "Азербайджанский": "az",
    "Баскский": "eu",
    "Белорусский": "be",
    "Бенгальский": "bn",
    "Боснийский": "bs",
    "Болгарский": "bg",
    "Каталанский": "ca",
    "Цыганский": "ceb",
    "Китайский (упрощенный)": "zh-cn",
    "Китайский (традиционный)": "zh-tw",
    "Корсиканский": "co",
    "Хорватский": "hr",
    "Чешский": "cs",
    "Датский": "da",
    "Нидерландский": "nl",
    "Английский": "en",
    "Эсперанто": "eo",
    "Эстонский": "et",
    "Финский": "fi",
    "Французский": "fr",
    "Фриульский": "fy",
    "Галисийский": "gl",
    "Грузинский": "ka",
    "Немецкий": "de",
    "Греческий": "el",
    "Гуджарати": "gu",
    "Гаэльский (ирландский)": "gd",
    "Хауса": "ha",
    "Гавайский": "haw",
    "Иврит": "he",
    "Хинди": "hi",
    "Хмонг": "hmn",
    "Венгерский": "hu",
    "Исландский": "is",
    "Игбо": "ig",
    "Индонезийский": "id",
    "Ирландский": "ga",
    "Итальянский": "it",
    "Японский": "ja",
    "Яванский": "jw",
    "Казахский": "kk",
    "Кхмерский": "km",
    "Киргизский": "ky",
    "Корейский": "ko",
    "Лаосский": "lo",
    "Латинский": "la",
    "Латышский": "lv",
    "Литовский": "lt",
    "Люксембургский": "lb",
    "Македонский": "mk",
    "Малагасийский": "mg",
    "Малайский": "ms",
    "Малаялам": "ml",
    "Мальтийский": "mt",
    "Маори": "mi",
    "Маратхи": "mr",
    "Монгольский": "mn",
    "Мьянмар (бирманский)": "my",
    "Непальский": "ne",
    "Норвежский": "no",
    "Нянджа (чичева)": "ny",
    "Ория (одия)": "or",
    "Пушту": "ps",
    "Персидский": "fa",
    "Польский": "pl",
    "Португальский": "pt",
    "Пенджаби": "pa",
    "Румынский": "ro",
    "Русский": "ru",
    "Самоанский": "sm",
    "Скотс гэльский": "gd",
    "Сербский": "sr",
    "Сесото": "st",
    "Шона": "sn",
    "Синдхи": "sd",
    "Сингальский": "si",
    "Словацкий": "sk",
    "Словенский": "sl",
    "Сомали": "so",
    "Испанский": "es",
    "Суахили": "sw",
    "Шведский": "sv",
    "Таджикский": "tg",
    "Тамильский": "ta",
    "Телугу": "te",
    "Тайский": "th",
    "Турецкий": "tr",
    "Украинский": "uk",
    "Урду": "ur",
    "Узбекский": "uz",
    "Вьетнамский": "vi",
    "Валлийский": "cy",
    "Коса": "xh",
    "Йидиш": "yi",
    "Йоруба": "yo",
    "Зулу": "zu"
}
